tsung/tsung_simple.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="demo.2iscm2mqr5.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  </servers>


  <load>
    <arrivalphase phase="1" duration="10" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <session name="http-example" probability="100" type="ts_http">
      <setdynvars sourcetype="random_string" length="10">
           <var name="user1_name"/>
      </setdynvars>
      <setdynvars sourcetype="random_string" length="10">
           <var name="user2_name"/>
      </setdynvars>
      <request subst="true">
           <dyn_variable name="user1_id" re="Location: http://.*/users/(.*)\r" ></dyn_variable>
           <http url='/users' version='1.1' method='POST' content_type='application/json' contents='{&quot;name&quot;: &quot;%%_user1_name%%&quot;}'></http>
      </request>
      <request subst="true">
           <dyn_variable name="user2_id" re="Location: http://.*/users/(.*)\r" ></dyn_variable>
           <http url='/users' version='1.1' method='POST' content_type='application/json' contents='{&quot;name&quot;: &quot;%%_user2_name%%&quot;}'></http>
      </request>
      <request subst="true">
           <dyn_variable name="game_configuration_id" re="Location: http://.*/game_configurations/(.*)\r" ></dyn_variable>
           <http url='/game_configurations' version='1.1' method='POST' content_type='application/json' contents='{&quot;name&quot;: &quot;%%_user2_name%%&quot;, &quot;num_matches&quot;: &quot;3&quot;, &quot;input_set&quot;: &quot;%%_user2_name%%&quot;}'></http>
      </request>
      <request subst="true">
           <dyn_variable name="match_id" re="Location: http://.*/matches/(.*)\r" ></dyn_variable>
           <http url='/matches' version='1.1' method='POST' content_type='application/json' contents='{&quot;user1_id&quot;: &quot;%%_user1_id%%&quot;, &quot;user2_id&quot;: &quot;%%_user2_id%%&quot;, &quot;game_configuration_id&quot;: &quot;%%_game_configuration_id%%&quot;}'></http>
      </request>
      <request subst="true">
           <http url='/matches/%%_match_id%%' version='1.1' method='GET'></http>
      </request>
      <request>
           <http url='/matches' version='1.1' method='GET'></http>
      </request>
      <!--Insert 1 call to /matches/id/join here for user 2-->
      <request subst="true">
           <http url='/matches/%%_match_id%%' version='1.1' method='GET'></http>
      </request>
      <!--Insert 2 calls to /matches/id/play here (1 / user)-->
      <request subst="true">
           <http url='/matches/%%_match_id%%' version='1.1' method='GET'></http>
      </request>
      <request subst="true">
           <http url='/matches/%%_match_id%%' version='1.1' method='GET'></http>
      </request>
      <request subst="true">
           <http url='/users/%%_user1_id%%' version='1.1' method='GET'></http>
      </request>
      <request subst="true">
           <http url='/users/%%_user2_id%%' version='1.1' method='GET'></http>
      </request>
    </session>
  </sessions>
</tsung>